Emacs/emacs.org
#+TITLE: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el
* COMMENT Dumping Emacs
#+begin_src emacs-lisp
;; dump后load-path值，当这个变量为nil时是不会加载pdmp的。
(defvar +dumped-load-path nil
  "Not nil when using dump.")

;; 通过dump启动时的配置
(when +dumped-load-path
  ;;恢复load-path
  (setq load-path +dumped-load-path)
  ;; 修改一下报错等级，这个读者按心意加，不影响dump
  (setq warning-minimum-level :emergency)
  (defun tramp-file-name-method--cmacro (&rest args))
  (require 'tramp)
  (setq tramp-mode 1)
  ;; 一些功能失常的mode，需要重新开启
  (global-font-lock-mode t)
  (meow-esc-mode 1)
  (transient-mark-mode t))

;; 非dump启动方式所需加载的配置
(unless +dumped-load-path
#+end_src
* Native Compilation
 #+begin_src emacs-lisp
    ;; Silence compiler warnings as they can be pretty disruptive
   (setq comp-async-report-warnings-errors nil)
 #+end_src
* Package Management
** Initialize package sources
 #+begin_src emacs-lisp
 ;; Initialize package sources
 (require 'package)

 (setq package-archives '(
			  ("melpa" . "https://melpa.org/packages/")
			  ("melpa" . "http://melpa.milkbox.net/packages/")
			  ("org" . "https://orgmode.org/elpa/")
			  ("elpa" . "https://elpa.gnu.org/packages/")
			  ))

 (package-initialize)
 (unless package-archive-contents
   (package-refresh-contents))

 #+end_src
** Initialize use-package on non-Linux platforms
 #+begin_src emacs-lisp
 ;; Initialize use-package on non-Linux platforms
 (unless (package-installed-p 'use-package)
   (package-install 'use-package))

 (require 'use-package)

 ;; always auto-download from source
 ;; (setq use-package-always-ensure t)
 #+end_src
** Straight.el
#+begin_src emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; Always use straight to install on systems other than Linux
(setq straight-use-package-by-default t)

;; Use straight.el for use-package expressions
(straight-use-package 'use-package)

;; Load the helper package for commands like `straight-x-clean-unused-repos'
(require 'straight-x)
#+end_src
** COMMENT Auto Update Packages
#+begin_src emacs-lisp
(use-package auto-package-update
  :custom
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-results t)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "09:00"))
#+end_src
* Pathes
** Exact Path on MacOs
 The package is help emacs to find exact path in the shell
 #+begin_src emacs-lisp
   ;; Find Executable Path on OS X
   (use-package exec-path-from-shell
     ;; :init
     ;; (when (memq window-system '(mac ns))
     ;;   (exec-path-from-shell-initialize))
     :config
     (use-package cache-path-from-shell
       :straight nil
       :load-path "~/.emacs.d/site-packages/cache-path-from-shell/")
     (when (memq window-system '(mac ns))
       (exec-path-from-shell-initialize))
     )
 #+end_src
** Update Load Path
#+begin_src emacs-lisp
;; Add my library path to load-path
(push "~/.emacs.d/elisp" load-path)

(push "~/Documents/Org" load-path)
#+end_src
* Auto Doing something
** Stop Backup and "Auto-Save"
 Stop backup and auto-save (save as a backup) made by emacs
 #+begin_src emacs-lisp
 ;; 关闭备份
 (setq make-backup-files nil
       auto-save-default nil)
 #+end_src
** Stop Auto-Change Vertical Scroll Size
 #+begin_src emacs-lisp
 (setq auto-window-vscroll nil)
 #+end_src
** Auto-Reverting Changed Files
 auto allow the outside changes
 #+begin_src emacs-lisp
 (global-auto-revert-mode 1)
 #+end_src
** Auto-Tangle emacs.org File
 Tangle (form a new file) on save
 #+begin_src emacs-lisp
 ;; Since we don't want to disable org-confirm-babel-evaluate all
 ;; of the time, do it around the after-save-hook
 (defun dw/org-babel-tangle-dont-ask ()
   ;; Dynamic scoping to the rescue
   (let ((org-confirm-babel-evaluate nil))
     (org-babel-tangle)))

 (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'dw/org-babel-tangle-dont-ask
                                               'run-at-end 'only-in-org-mode)))
 #+end_src
** Auto-Saving Changed Files
 The package make emacs auto save the files
 #+begin_src emacs-lisp
 (use-package super-save
   :defer 1
   :diminish super-save-mode
   :config
   (super-save-mode +1)
   (setq super-save-auto-save-when-idle t))
 #+end_src
* UI Setup
** Hide Useless UI
 #+begin_src emacs-lisp
 (setq inhibit-startup-message t)

 (scroll-bar-mode -1)        ; Disable visible scrollbar
 (tool-bar-mode -1)          ; Disable the toolbar
 (tooltip-mode -1)           ; Disable tooltips
 (set-fringe-mode 10)

 (menu-bar-mode -1)            ; Disable the menu bar

 (setq ring-bell-function 'ignore)
 #+end_src
** Frame Transparency and Maximize Windows
 #+begin_src emacs-lisp
 ;; Set frame transparency and maximize windows by default.
 (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
 (add-to-list 'default-frame-alist '(alpha . (90 . 90)))
 (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
 (add-to-list 'default-frame-alist '(fullscreen . maximized))
 #+end_src
** Line Number
 #+begin_src emacs-lisp
 ;; Enalbe column number
 (column-number-mode)

 ;; Enable liner number
 (global-display-line-numbers-mode t)

 ;; Disable line numbers for some modes
 (dolist (mode '(org-mode-hook
                 term-mode-hook
		 vterm-mode-hook
		 shell-mode-hook
                 eshell-mode-hook))
   (add-hook mode (lambda () (display-line-numbers-mode 0))))
 #+end_src
** Fonts
 #+begin_src emacs-lisp
 (defun dw/set-font-faces ()
   (message "Setting faces!")
   ;; set font
   (set-face-attribute 'default nil :font "Victor Mono" :height 140)

   ;; Set the fixed pitch face
   (set-face-attribute 'fixed-pitch nil :font "Victor Mono" :height 140)

   ;; Set the variable pitch face
   (set-face-attribute 'variable-pitch nil :font "Cantarell" :height 175 :weight 'regular))
 #+end_src
** Fonts Ligature
#+begin_src emacs-lisp
  (use-package ligature
    :straight nil
    :load-path "~/.emacs.d/site-packages/ligature.el/"
    :config
    ;; Enable the "www" ligature in every possible major mode
    (ligature-set-ligatures 't '("www"))
    ;; Enable traditional ligature support in eww-mode, if the
    ;; `variable-pitch' face supports it
    (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
    ;; Enable all Cascadia Code ligatures in programming modes
    (ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
					 ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
					 "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
					 "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
					 "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
					 "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
					 "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
					 "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
					 ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
					 "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
					 "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
					 "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
					 "\\\\" "://"))
    ;; Enables ligature checks globally in all buffers. You can also do it
    ;; per mode with `ligature-mode'.
    (global-ligature-mode t))
#+end_src
** Icons Support 
 #+begin_src emacs-lisp
 (use-package all-the-icons)
 #+end_src
** Themes
 #+begin_src emacs-lisp
 (use-package doom-themes)

 (use-package nord-theme)

 (use-package lab-themes)
 #+end_src
** Change Theme Based On System Appearance
#+begin_src emacs-lisp
(defun dw/apply-theme (appearance)
  "Load theme, taking current system APPEARANCE into consideration."
  (mapc #'disable-theme custom-enabled-themes)
  (pcase appearance
    ('light (load-theme 'doom-solarized-light t))
    ('dark (load-theme 'doom-one t))))
#+end_src
** Modeline 
 #+begin_src emacs-lisp
 (use-package doom-modeline
   :init (doom-modeline-mode 1)
   :config
   (setq doom-modeline-env-version t))
 #+end_src
** Dashbard
 #+begin_src emacs-lisp
 (use-package dashboard
   :init
   ;; Set the title
   ;; (setq dashboard-banner-logo-title "Code Better, Live Longer!")
   ;; Set the banner
   (setq dashboard-startup-banner "~/.emacs.d/dashboard/banner.txt")
   (setq dashboard-center-content t)
   :config
   (dashboard-setup-startup-hook)
   (setq dashboard-items '((recents  . 7)
                           (projects . 5)
                           ;; To display today’s agenda items on the dashboard
                           (agenda . 5)
                           ))
   ;; To show agenda for the upcoming seven days
   ;; (setq dashboard-week-agenda t)
   ;; To customize which categories from the agenda items should be visible in the dashboard
   ;; (setq dashboard-org-agenda-categories '("Tasks" "Appointments"))
   ;; To show all agenda entries
   ;; (setq dashboard-filter-agenda-entry 'dashboard-no-filter-agenda)
   ;; To have an extra filter
   ;; (setq dashboard-match-agenda-entry nil)

   (setq dashboard-set-heading-icons t)
   (setq dashboard-set-file-icons t)
   (setq dashboard-set-init-info t)
   )
 #+end_src
** Nyan Mode
#+begin_src emacs-lisp
(use-package nyan-mode
 :config
 (setq nyan-mode t)
 :custom
 (nyan-animate-nyancat t)
 (nyan-wavy-trail t)
 )
#+end_src
** Highlight TODOs
#+begin_src emacs-lisp
(use-package hl-todo
  :hook (prog-mode . hl-todo-mode)
  :config
  (setq hl-todo-keyword-faces
      '(("TODO"   . "#FF0000")
        ("FIXME"  . "#FF0000")
        ("DEBUG"  . "#A020F0")
        ("NEXT" . "#FF4500")
        ("UNCHECK"   . "#1E90FF")))
  )
#+end_src
** Highligh Numbers
#+begin_src emacs-lisp
(use-package highlight-numbers
  :hook (prog-mode . highlight-numbers-mode))
#+end_src
** UI in Deamon
#+begin_src emacs-lisp
(if (daemonp)
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                (setq doom-modeline-icon t)
		;; (load-theme 'doom-one t)
		(add-hook 'ns-system-appearance-change-functions #'dw/apply-theme)
		(dashboard-setup-startup-hook)
                (with-selected-frame frame
                  (dw/set-font-faces))
		(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
		))
  ;; (load-theme 'doom-one t)
  ;; (lab-themes-load-style 'dark)
  (add-hook 'ns-system-appearance-change-functions #'dw/apply-theme)
  (dw/set-font-faces)
  )
#+end_src
* Midnight Mode
#+begin_src emacs-lisp
  (use-package midnight
    :ensure nil
    :config
    (setq midnight-mode 1)
    (setq midnight-period 7200))
#+end_src
* Cl-lib
#+begin_src emacs-lisp
(use-package cl-libify)
#+end_src
* Window Management
** Ace Window
   Use =C-x o= to active =ace-window= to swap the windows (less than two windows), or using following arguments (more than two):
- =x= - delete window
- =m= - swap windows
- =M= - move window
- =c= - copy window
- =j= - select buffer
- =n= - select the previous window
- =u= - select buffer in the other window
- =c= - split window fairly, either vertically or horizontally
- =v= - split window vertically
- =b= - split window horizontally
- =o= - maximize current window
- =?= - show these command bindings
#+begin_src emacs-lisp
(use-package ace-window
  :bind ("C-x o" . ace-window)
  :config
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))
#+end_src
* File Management
** Dired
 #+begin_src emacs-lisp
    (use-package dired
      :ensure nil
      :straight nil
      :commands (dired dired-jump)
      :bind (("C-x C-j" . dired-jump))
      ;;:config
      ;;(evil-collection-define-key 'normal 'dired-mode-map
      ;;  "d" 'dired-single-up-directory
      ;;  "n" 'dired-single-buffer)
      )

    (use-package dired-single)

    (use-package all-the-icons-dired
      :hook (dired-mode . all-the-icons-dired-mode))

    (use-package dired-hide-dotfiles
      :hook (dired-mode . dired-hide-dotfiles-mode)
      ;;:config
      ;;(evil-collection-define-key 'normal 'dired-mode-map
      ;;  "H" 'dired-hide-dotfiles-mode)
      )
 #+end_src
* Keybinding Management
** COMMENT Keybindings by general.el
 #+begin_src emacs-lisp
 (use-package general
   :config
   (general-evil-setup t)

   (general-create-definer dw/leader-key-def
     :keymaps '(normal insert visual emacs)
     :prefix "SPC"
     :global-prefix "C-SPC")

   (general-create-definer dw/ctrl-c-keys
     :prefix "C-c"))
 #+end_src
** Keybinding Panel (which-key)
 #+begin_src emacs-lisp
 (use-package which-key
   :init (which-key-mode)
   :diminish which-key-mode
   :config
   (setq which-key-idle-delay 0.3))
 #+end_src
* Project Management
** Projectile
 #+begin_src emacs-lisp
 (use-package projectile
   :diminish projectile-mode
   :config (projectile-mode)
   :custom ((projectile-completion-system 'ivy))
   :bind-keymap
   ("C-c p" . projectile-command-map)
   :init
   (when (file-directory-p "~Documents/Projects/Code")
     (setq projectile-project-search-path '("~Documents/Projects/Code")))
   (setq projectile-switch-project-action #'projectile-dired))

 (use-package counsel-projectile
   :after projectile
   :config (counsel-projectile-mode))
 #+end_src
* Ivy
** Ivy Mode
 #+begin_src emacs-lisp
 (use-package ivy
   :diminish
   :bind (("C-s" . swiper)
          :map ivy-minibuffer-map
          ("C-l" . ivy-alt-done)
          ("C-n" . ivy-next-line)
          ("C-p" . ivy-previous-line)
          :map ivy-switch-buffer-map
          ("C-p" . ivy-previous-line)
          ("C-l" . ivy-done)
          ("C-d" . ivy-switch-buffer-kill)
          :map ivy-reverse-i-search-map
          ("C-p" . ivy-previous-line)
          ("C-d" . ivy-reverse-i-search-kill))
   :init
   (ivy-mode 1))

 (use-package counsel
   :bind (("M-x" . counsel-M-x)
          ("C-x b" . counsel-switch-buffer)
          ("C-x C-f" . counsel-find-file)
          :map minibuffer-local-map
          ("C-r" . 'counsel-minibuffer-histor))
   :config
   (setq ivy-initial-inputs-alist nil) ;; Don't start searches with ^
   )
 #+end_src
** Ivy Rich
 #+begin_src emacs-lisp
 (use-package ivy-rich
   :init
   (ivy-rich-mode 1))
 #+end_src
** Ivy Posframe
 #+begin_src emacs-lisp
   (use-package ivy-posframe
    :config
     (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-center)))
     (ivy-posframe-mode 1))
 #+end_src
* Helpful function
** Helpful Function Description
 #+begin_src emacs-lisp
 (use-package helpful
   :ensure t
   :custom
   (counsel-describe-function-function #'helpful-callable)
   (counsel-describe-variable-function #'helpful-variable)
   :bind
   ([remap describe-function] . counsel-describe-function)
   ([remap describe-command] . helpful-command)
   ([remap describe-variable] . counsel-describe-variable)
   ([remap describe-key] . helpful-key))
 #+end_src

* Org Mode
** Org Babel Browser
 Add *HTML* for =org-babel=
 #+begin_src emacs-lisp
 (use-package ob-browser)
 #+end_src
