Emacs/emacs.org
** Config Basic Org mode
 #+begin_src emacs-lisp
 (defun dw/org-mode-setup ()
   (org-indent-mode)
   (variable-pitch-mode 1)
   (visual-line-mode 1))

 (use-package org
   :defer t
   :hook (org-mode . dw/org-mode-setup)
   :config
   (setq org-html-head-include-default-style nil)
   (setq org-ellipsis " ▾"
         org-hide-emphasis-markers nil
         org-src-fontify-natively t
         org-src-tab-acts-natively t
         org-edit-src-content-indentation 0
         org-hide-block-startup nil
         org-src-preserve-indentation nil
         org-startup-folded 'content
         org-cycle-separator-lines 2)
   (setq org-format-latex-options (plist-put org-format-latex-options :scale 2.0))

   (setq org-html-htmlize-output-type nil)

   ;; 图片默认宽度
   (setq org-image-actual-width '(300))

   (setq org-export-with-sub-superscripts nil)

   ;; 不要自动创建备份文件
   (setq make-backup-files nil)

   (require 'init-org-agenda)

   (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
      (latex . t)
      (java . t)
      (C . t)
      (js . t)
      (css . t)
      (browser . t)
      (R . t)
      (ditaa . t)
      (python . t)))

   (setq org-confirm-babel-evaluate nil)
   (push '("conf-unix" . conf-unix) org-src-lang-modes))
 #+end_src
** Bullets
 #+begin_src emacs-lisp
 ;; change bullets for headings
 (use-package org-bullets
   :after org
   :hook (org-mode . org-bullets-mode)
   :custom
   (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

 ;; Replace list hyphen(-) with dot(.)
 ;; (font-lock-add-keywords 'org-mode
 ;;                         '(("^ *\\([-]\\) "
 ;;                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
 #+end_src
** Fonts
 #+begin_src emacs-lisp
 ;; Make sure org faces is available
 (require 'org-faces)
 ;; Make sure org-indent face is available
 (require 'org-indent)
 ;; Set Size and Fonts for Headings
 (dolist (face '((org-level-1 . 1.2)
                 (org-level-2 . 1.1)
                 (org-level-3 . 1.05)
                 (org-level-4 . 1.0)
                 (org-level-5 . 1.1)
                 (org-level-6 . 1.1)
                 (org-level-7 . 1.1)
                 (org-level-8 . 1.1)))
     (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

 ;; Ensure that anything that should be fixed-pitch in Org files appears that way
 (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
 (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
 (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
 (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
 (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
 (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
 (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
 (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

 #+end_src
** Src Block Templates
 #+begin_src emacs-lisp
 ;; This is needed as of Org 9.2
 (require 'org-tempo)

 (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
 (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
 (add-to-list 'org-structure-template-alist '("java" . "src java"))
 (add-to-list 'org-structure-template-alist '("srcc" . "src C"))
 (add-to-list 'org-structure-template-alist '("cpp" . "src cpp"))
 (add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
 (add-to-list 'org-structure-template-alist '("js" . "src js"))
 (add-to-list 'org-structure-template-alist '("css" . "src css"))
 (add-to-list 'org-structure-template-alist '("html" . "src browser :out"))
 (add-to-list 'org-structure-template-alist '("py" . "src python :results output :exports both"))
 (add-to-list 'org-structure-template-alist '("la" . "latex"))
 (add-to-list 'org-structure-template-alist '("r" . "src R"))
 (add-to-list 'org-structure-template-alist '("d" . "src ditaa :file ../images/.png :cmdline -E"))
 #+end_src
** Set Margins for Modes
 #+begin_src emacs-lisp
 (defun dw/org-mode-visual-fill ()
   (setq visual-fill-column-width 100
         visual-fill-column-center-text t)
   (visual-fill-column-mode 1))

 (use-package visual-fill-column
   :defer t
   :hook (org-mode . dw/org-mode-visual-fill))
 #+end_src
** Disable the Actual Width of a Picture
 #+begin_src emacs-lisp
 (setq org-image-actual-width nil)
 #+end_src
** Org download
 #+begin_src emacs-lisp
 (use-package org-download
	   :ensure t 
	   ;;将截屏功能绑定到快捷键：Ctrl + Shift + Y
	   :bind ("C-S-y" . org-download-screenshot)
	   :config
	   (require 'org-download)
	   ;; Drag and drop to Dired
	   (add-hook 'dired-mode-hook 'org-download-enable))
 #+end_src
** Auto Show Images in Org
 #+begin_src emacs-lisp
 (auto-image-file-mode t) 
 #+end_src
** COMMENT Convert to HTML
 #+begin_src emacs-lisp
 (use-package htmlize)
 #+end_src
** Org Latex Impatient
 #+begin_src emacs-lisp
 (use-package org-latex-impatient
   :defer t
   :hook (org-mode . org-latex-impatient-mode)
   :init
   (setq org-latex-impatient-tex2svg-bin
         ;; location of tex2svg executable
         "~/.nvm/versions/node/v15.5.1/lib/node_modules/mathjax-node-cli/bin/tex2svg")
   :custom
   (org-latex-impatient-posframe-position-handler 'posframe-poshandler-point-bottom-left-corner))
 #+end_src
** Org Agenda
#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/init-org-agenda.el
(setq org-agenda-files (list
			 "~/Documents/Org/Tasks.org"
			 "~/Documents/Org/Days.org"
			 "~/Documents/Org/Habits.org"
			 ))

;; If you only want to see the agenda for today
;; (setq org-agenda-span 'day)

(setq org-agenda-start-with-log-mode t)
(setq org-log-done 'time)
(setq org-log-into-drawer t)

;; Custom TODO states and Agendas
(setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
	;; (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")
	))

(setq org-tag-alist
    '((:startgroup)
       ; Put mutually exclusive tags here
       (:endgroup)
       ("@review" . ?R)
       ("@assignment" . ?A)
       ("@pratice" . ?P)
       ("planning" . ?p)
       ("note" . ?n)
       ("idea" . ?i)))

;; Configure custom agenda views
(setq org-agenda-custom-commands
      '(("d" "Dashboard"
	 ((agenda "" ((org-deadline-warning-days 7)))
	  (todo "NEXT"
		((org-agenda-overriding-header "Next Tasks")))
	  (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

	("n" "Next Tasks"
	 ((todo "NEXT"
		((org-agenda-overriding-header "Next Tasks")))))


	("W" "Work Tasks" tags-todo "+work")

	;; Low-effort next actions
	("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
	 ((org-agenda-overriding-header "Low Effort Tasks")
	  (org-agenda-max-todos 20)
	  (org-agenda-files org-agenda-files)))

	("w" "Workflow Status"
	 ((todo "WAIT"
		((org-agenda-overriding-header "Waiting on External")
		 (org-agenda-files org-agenda-files)))
	  (todo "REVIEW"
		((org-agenda-overriding-header "In Review")
		 (org-agenda-files org-agenda-files)))
	  (todo "PLAN"
		((org-agenda-overriding-header "In Planning")
		 (org-agenda-todo-list-sublevels nil)
		 (org-agenda-files org-agenda-files)))
	  (todo "BACKLOG"
		((org-agenda-overriding-header "Project Backlog")
		 (org-agenda-todo-list-sublevels nil)
		 (org-agenda-files org-agenda-files)))
	  (todo "READY"
		((org-agenda-overriding-header "Ready for Work")
		 (org-agenda-files org-agenda-files)))
	  (todo "ACTIVE"
		((org-agenda-overriding-header "Active Projects")
		 (org-agenda-files org-agenda-files)))
	  (todo "COMPLETED"
		((org-agenda-overriding-header "Completed Projects")
		 (org-agenda-files org-agenda-files)))
	  (todo "CANC"
		((org-agenda-overriding-header "Cancelled Projects")
		 (org-agenda-files org-agenda-files)))))))

;; Refiling
(setq org-refile-targets
      '(("Archive.org" :maxlevel . 1)))

;; Save Org buffers after refiling!
(advice-add 'org-refile :after 'org-save-all-org-buffers)

;; Capture Templates
(defun dw/read-file-as-string (path)
  (with-temp-buffer
    (insert-file-contents path)
    (buffer-string)))

(setq org-capture-templates
      `(("t" "Tasks / Projects")
	("tt" "Task" entry (file+olp "~/Documents/Org/Tasks.org" "Inbox")
         "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)))

;; Habit Tracking
(require 'org-habit)
(add-to-list 'org-modules 'org-habit)
(setq org-habit-graph-column 60)

(provide 'init-org-agenda)
#+end_src
** Org Roam
 #+begin_src emacs-lisp
 (use-package org-roam
       :ensure t
       :hook
       (after-init . org-roam-mode)
       :custom
       (org-roam-directory "~/Documents/Org/Wiki")
       :bind (:map org-roam-mode-map
               (("C-c n l" . org-roam)
		("C-c n f" . org-roam-find-file)
		("C-c n g" . org-roam-graph))
               :map org-mode-map
               (("C-c n i" . org-roam-insert))
               (("C-c n I" . org-roam-insert-immediate))))
 #+end_src
** Org Roam Server
 #+begin_src emacs-lisp
 (use-package org-roam-server
   :ensure t
   :after org-mode
   :config
   (setq org-roam-server-host "127.0.0.1"
         org-roam-server-port 9090
         org-roam-server-authenticate nil
         org-roam-server-export-inline-images t
         org-roam-server-serve-files nil
         org-roam-server-served-file-extensions '("pdf" "mp4" "ogv")
         org-roam-server-network-poll t
         org-roam-server-network-arrows nil
         org-roam-server-network-label-truncate t
         org-roam-server-network-label-truncate-length 60
         org-roam-server-network-label-wrap-length 20))
 #+end_src
** Properly Align Tables
 #+begin_src emacs-lisp
 (use-package valign
   :hook (org-mode . valign-mode))
 #+end_src
* Markdown Mode
** Mardown Mode
 #+begin_src emacs-lisp
 (use-package markdown-mode
   :mode (("README\\.md\\'" . gfm-mode)
          ("\\.md\\'" . down-mode)
          ("\\.jown\\'" . jown-mode))
   :init (setq jown-command "multijown"))
 #+end_src
** Edit Code Block
 #+begin_src emacs-lisp
 (use-package edit-indirect)
 #+end_src
* Editing
** COMMENT Evil Mode
 #+begin_src emacs-lisp
 (defun dw/evil-hook ()
   (dolist (mode '(custom-mode
                   eshell-mode
		   vterm-mode
                   term-mode))
     (add-to-list 'evil-emacs-state-modes mode)))

 (use-package evil
   :init
   (setq evil-want-integration t)
   (setq evil-want-keybinding nil)
   (setq evil-want-C-u-scroll t)
   (setq evil-want-C-i-jump nil)
   (setq evil-respect-visual-line-mode t)
   :config
   (add-hook 'evil-mode-hook 'dw/evil-hook)
   (evil-mode 1)
   (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
   (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

   ;; Use visual line motions even outside of visual-line-mode buffers
   (evil-global-set-key 'motion "j" 'evil-next-visual-line)
   (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

   (evil-set-initial-state 'messages-buffer-mode 'normal)
   (evil-set-initial-state 'dashboard-mode 'normal))

 (use-package evil-collection
   :after evil
   :custom
   (evil-collection-outline-bind-tab-p nil)
   :config
   (evil-collection-init))
 #+end_src
*** Evil Cursor Changer (Terminal)
  #+begin_src emacs-lisp
  (unless (display-graphic-p)
    (use-package evil-terminal-cursor-changer
      :ensure t
      :init
      (evil-terminal-cursor-changer-activate)
      :config
       (setq evil-motion-state-cursor 'box)  ; █
       (setq evil-visual-state-cursor 'box)  ; █
       (setq evil-normal-state-cursor 'box)  ; █
       (setq evil-insert-state-cursor 'bar)  ; ⎸
       (setq evil-emacs-state-cursor  'hbar) ; _
       )
    )
  #+end_src
*** Evil Surround
  - Add surrounding
    - In visual-state with =S<textobject>= or =gS<textobject>=. Or in normal-state with =ys<textobject>= or =yS<textobject>=.
  - Change surroundinf
    - =cs<old-textobject><new-textobject>=
  - Delete surrounding
    - =ds<textobject>=
  #+begin_src emacs-lisp
  (use-package evil-surround
    :after evil
    :config
    (global-evil-surround-mode 1))
  #+end_src
*** Evil Escape
  #+begin_src emacs-lisp
  (use-package evil-escape
    :after evil
    :config
    (evil-escape-mode t)
    (setq-default evil-escape-key-sequence "jk"))
  #+end_src
*** COMMENT Evil Multiple Cursors
  #+begin_src emacs-lisp
  (use-package evil-mc
    :config
    (global-evil-mc-mode  1))

  (dw/leader-key-def
    "m"  '(:ignore t :which-key "evil-mc")
    "ma" 'evil-mc-make-all-cursors
    "mu" 'evil-mc-undo-all-cursors
    "mmn" 'evil-mc-make-and-goto-next-match
    "mmp" 'evil-mc-make-and-goto-prev-match
    "mkn" 'evil-mc-skip-and-goto-next-match
    "mkp" 'evil-mc-skip-and-goto-prev-match
    "mI" 'evil-mc-make-cursor-in-visual-selection-beg
    "mA" 'evil-mc-make-cursor-in-visual-selection-end)
  #+end_src
